Tekla Open API Reference for Tekla Structures 2025
RectangleAttributes Properties
The Rectangle.RectangleAttributes type exposes the following members.
Properties
Name | Description
BehindModelObjects
 Gets or sets whether the closed graphic object is drawn behind model objects
 (Inherited from ClosedGraphicObject.ClosedGraphicObjectAttributes.)
Bulge
 The bulge value for the rectangle.
Hatch
 The hatch attributes of the closed graphic object (the closed graphic object is hatchable).
 (Inherited from ClosedGraphicObject.ClosedGraphicObjectAttributes.)
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
 (Inherited from GraphicObject.GraphicObjectAttributes.)
Top
See Also
Reference
Rectangle.RectangleAttributes Class
Tekla.Structures.Drawing Namespace